<?php

return [
    'search_trainee_teachers'       => 'ស្វែងរកព័ត៌មានគរុសិស្ស-និស្សិត',
    'stu_generation'                => 'ជំនាន់សិក្សា',
    'future_location'               => 'អង្គភាពត្រូវទៅបម្រើការងារ',
    'future_province'               => 'រាជធានី/ខេត្តទៅបម្រើការងារ',
    'edit_future_location'          => 'កែប្រែអង្គភាពត្រូវទៅបម្រើការងារ',
    'transfer_trainee'              => 'ផ្ទេរគ្រូចេញ',
    'failed_trainee_list'           => 'បញ្ជីឈ្មោះអ្នកធ្លាក់',
    'transfer_verified_msg'         => 'សូមផ្ទៀងចំនួនគរុសិស្សដែលប្រលងធ្លាក់ឲ្យគ្រប់ចំនួននិងត្រឹមត្រូវតាមឈ្មោះ',
    'no_failed_trainees'            => 'គ្មានអ្នកធ្លាក់',
    'is_staff_msg'                  => 'ទិន្នន័យមានរួចហើយ ដែលជាអតីតបុគ្គលិក',
    'qualification'                 => 'កម្រិតវិជ្ជាជីវៈ',

    'success' => [
        'deleted' => 'អ្នកបានលុបអង្គភាពដោយជោគជ័យ',
        'created' => 'អ្នកបានបង្កើតអង្គភាពដោយជោគជ័យ',
        'updated' => 'អ្នកបានធ្វើបច្ចុប្បន្នភាពដោយជោគជ័យ',
        'transferred' => 'អ្នកបានបញ្ជូនគរុសិស្ស-និស្សិតទៅដោយជោគជ័យ'
    ]
];
