<?php

return [

	'required' => 'សូមបំពេញ :attribute',
	'unique' => ':attribute មានរួចហើយ',
    'between' => [
        'numeric' => 'សូមបំពេញ :attribute ចន្លោះ :min និង :max.',
    ],

    'size' => [
        'numeric' => 'The :attribute must be :size.',
        'file' => 'The :attribute must be :size kilobytes.',
        'string' => 'សូមបំពេញ :attribute អោយបាន :size តួអក្សរ.',
        'array' => 'The :attribute must contain :size items.',
    ],
    'tcp_doc'   => 'ទំហំ :attribute មិនអាចធំជាង :max MB បានទេ.',
    'location_not_exist' => 'ឈ្មោះរបស់អង្គភាពមិនត្រឹមត្រូវទេ សូមពិនិត្យឡើងវិញម្តងទៀត។ សូមអរគុណ។',
	'add_success' => 'ទិន្ន័យរបស់លោកអ្នកត្រូវបានដាក់បញ្ចូលរួចរាល់ហើយ។ សូមអរគុណ។',
    'duplicate' => 'ទិន្ន័យរបស់លោកអ្នកមិនត្រូវបានបញ្ចូលនៅឡើយទេ។ ពត៌មានមានរួចរាល់ហើយ សូមពិនិត្យឡើងវិញ។ សូមអរគុណ។',
	'duplicate_payroll' => 'ទិន្ន័យរបស់លោកអ្នកមិនត្រូវបានបញ្ចូលនៅឡើយទេ។ អត្តលេខនេះមានរួចរាល់ហើយ សូមពិនិត្យឡើងវិញ។ សូមអរគុណ។',
    'duplicate_field_code' => 'លេខកូដវិស័យសិក្សាមានរួចហើយ។ សូមអរគុណ។',
    'duplicate_field_kh' => 'ឈ្មោះវិស័យសិក្សាជាភាសាខ្មែរមានរួចហើយ។ សូមអរគុណ។',
    'duplicate_subject_code' => 'លេខកូដមុខវិជ្ជាសិក្សាមានរួចហើយ។ សូមអរគុណ។',
    'duplicate_subject_kh' => 'ឈ្មោះមុខវិជ្សិក្សាជាជាភាសាខ្មែរមានរួចហើយ។ សូមអរគុណ។',
	'delete_success' => 'ទិន្ន័យរបស់លោកអ្នកត្រូវបានលុបចោលរួចរាល់ហើយ។ សូមអរគុណ។',
    'disable_success' => 'ទិន្ន័យរបស់លោកអ្នកត្រូវបានបិទជាបណ្តោះអាសន្នចោលរួចរាល់ហើយ។ សូមអរគុណ។',
	'error_message' => 'សូមបំពេញពត៌មានខាងក្រោមអោយបានត្រឹមត្រូវ ហើយព្យាយាមម្តងទៀត។ សូមអរគុណ!',
	'required_field' => 'សូមបំពេញពត៌មាននេះ',
	'update_success' => 'ទិន្ន័យរបស់លោកអ្នកត្រូវបានកែប្រែរួចរាល់ហើយ។ សូមអរគុណ។',
	'lt_date' => 'ទិន្ន័យរបស់លោកអ្នកមិនត្រូវបានបញ្ចូលនៅឡើយទេ, ថ្ងៃចាប់ផ្តើមថ្មីមិនអាចនៅក្រោយថ្ងៃចាប់ផ្តើមទិន្ន័យចាស់បានឡើយ៕ សូមអរគុណ!',

	'min' => [
        'numeric' => 'សូមបញ្ចូល :attribute យ៉ាងហោចណាស់ :min.',
        'file' => 'The :attribute must be at least :min kilobytes.',
        'string' => 'សូមបញ្ចូល :attribute អោយបាន :min ខ្ទង់.',
        'array' => 'The :attribute must have at least :min items.',
    ],

    'max' => [
        'numeric' => 'សូមបញ្ចូលពិន្ទុ :attribute ច្រើនបំផុតត្រឹម :max.',
        'file' => 'ទំហំ :attribute មិនអាចធំជាង :max KB បានទេ.',
        'string' => 'សូមបញ្ចូល :attribute អោយបាន :max ខ្ទង់.',
        'array' => 'The :attribute may not have more than :max items.',
    ],
    'after_or_equal' => ':attribute ត្រូវតែធំជាងឬស្មើ​ :date.',
	'user_approved' => 'User account has been approved successfully.',
    'gte_start_date' => 'ថ្ងៃខែឆ្នាំបញ្ចប់ ត្រូវតែធំជាង ថ្ងៃខែឆ្នាំចាប់ផ្តើម។',
    'gte_reg_start_date' => 'ថ្ថៃខែឆ្នាំបញ្ចប់ការចុះឈ្មោះ ត្រូវតែធំជាង ថ្ងៃខែឆ្នាំចាប់ផ្តើមការចុះឈ្មោះ។',
    'location_code_exist' => 'លេខកូដអង្គភាពមានរួចហើយ។ បើចង់កែឬបង្កើតថ្មី សូមទាក់ទងទៅកាន់អ្នកគ្រប់គ្រងទិន្នន័យ',
    'checkbox_required' => 'សូមចុចប្រអប់ "យល់ព្រម" ជាមុនសិន មុននឹងដំណើរការ។',
    'transfer_success' => 'ការផ្លាស់ប្តូរបានជោគជ័យ។',
    'change_location_success' => 'បានជ្រើសរើសអង្គភាពថ្មីដោយជោគជ័យ។',
    'unique_payroll' => 'អត្តលេខមន្ត្រីបានប្រើប្រាស់រួចហើយ។ សូមបញ្ចូលអត្ថលេខថ្មី។',
    'unique_username' => 'ឈ្មោះគណនេយ្យបានប្រើប្រាស់រួចហើយ។ សូមបញ្ចូលឈ្មោះគណនេយ្យថ្មី។',
    'dob_age_validate' => ' មិនត្រឹមត្រូវទេ។ ថ្ងៃខែឆ្នាំកំណើតត្រូវតែធំជាងឆ្នាំ1900 និងតូចជាងឆ្នាំ ',
    'start_date_validate' => ' មិនត្រឹមត្រូវទេ។ ថ្ងៃខែឆ្នាំកំណើតត្រូវតែធំជាងឆ្នាំ1980 និងតូចជាងឆ្នាំ ',
    'required_grade_and_teacher' => 'សូមជ្រើសរើសកម្រិតថ្នាក់ និងគ្រូបង្រៀន អោយបានយ៉ាងតិចចំនួន ១។',

];
